ДСУтест/src/Documents/РасходДенежныхСредств/РасходДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходДенежныхСредств</name>
  <basedOn>Task.Напоминание</basedOn>
  <registerRecords>AccumulationRegister.ОстаткиПланируемыхПокупок</registerRecords>
  <registerRecords>InformationRegister.СостоянияПланируемыхПокупок</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиПоСчетам</registerRecords>
  <registerRecords>AccumulationRegister.ДолговыеОбязательства</registerRecords>
  <registerRecords>AccumulationRegister.Расходы</registerRecords>
  <attributes>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиДДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кратность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </attributes>
  <attributes>
    <name>НеУчитыватьВСтруктуреРасходов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсключитьИзПланирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

ДСУтест/src/AccumulationRegisters/ОстаткиПоСчетам/ОстаткиПоСчетам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПоСчетам</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУчетн</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Счет</name>
    <type>
      <types>CatalogRef.Счета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/AccumulationRegisters/ДолговыеОбязательства/ДолговыеОбязательства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДолговыеОбязательства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СрокИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Должник</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/InformationRegisters/СостоянияПланируемыхПокупок/СостоянияПланируемыхПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СостоянияПланируемыхПокупок</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияПланируемойПокупки</types>
    </type>
  </attributes>
  <dimensions>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ДСУтест/src/AccumulationRegisters/ОстаткиПланируемыхПокупок/ОстаткиПланируемыхПокупок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ОстаткиПланируемыхПокупок</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ПланируемаяПокупка</name>
    <type>
      <types>CatalogRef.ПланируемыеПокупки</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ДСУтест/src/Enums/СостоянияПланируемойПокупки/СостоянияПланируемойПокупки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияПланируемойПокупки</name>
  <enumValues>
    <name>Регистрация</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Замораживание</name>
  </enumValues>
  <enumValues>
    <name>ПеремещениеПодДругуюПокупку</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
</mdclass:Enum>

ДСУтест/src/Documents/РасходДенежныхСредств/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	УчётнаяСумма = Сумма*Курс/Кратность;	
	
	// проведение по регистру "Остатки по счетам"
	ДвижениеОстатки = Движения.ОстаткиПоСчетам.ДобавитьРасход();
	ЗаполнитьЗначенияСвойств(ДвижениеОстатки, Ссылка);
	ДвижениеОстатки.СуммаУчетн = УчётнаяСумма;
	ДвижениеОстатки.Период = Дата;
	
	// определим возможность проведения по регистрам
	// для забалансовых счетов нет смысла считать расходы, нужно только контролировать остатки
	УчётРасходы = Не (Счет.Забалансовый Или НеУчитыватьВСтруктуреРасходов);
	УчётДолговыеОбязательства = (Не Счет.Забалансовый) И ЗначениеЗаполнено(Должник);
	УчётПланируемыеПокупки = (Не Счет.Забалансовый) И ЗначениеЗаполнено(ПланируемаяПокупка);
	
	// проведение по регистру "Расходы"
	Если УчётРасходы Тогда  
		
		ДвижениеРасходы = Движения.Расходы.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеРасходы, Ссылка);
		ДвижениеРасходы.СуммаУчетн = УчётнаяСумма;
		ДвижениеРасходы.Период = Дата;
		
	КонецЕсли;	
	
	// формируем движения по регистру "Долговые обязательства"
	Если УчётДолговыеОбязательства Тогда
		
		ДвижениеДолги = Движения.ДолговыеОбязательства.ДобавитьПриход();
		ЗаполнитьЗначенияСвойств(ДвижениеДолги, Ссылка);
		ДвижениеДолги.Должник = Ссылка.Должник;
		ДвижениеДолги.Период = Дата;
		
	КонецЕсли;
	
	// обработаем расход по запланированной покупке
	Если УчётПланируемыеПокупки Тогда
		
		// добавим запись в регистр сведений "Состояния планируемых покупок" 
		ДвижениеСостояние = Движения.СостоянияПланируемыхПокупок.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеСостояние, Ссылка, "Сумма,ПланируемаяПокупка");
		ДвижениеСостояние.Период = Дата;
		ДвижениеСостояние.Состояние = ПредопределенноеЗначение("Перечисление.СостоянияПланируемойПокупки.Завершение");
		
		// вычислим разницу между запланированной и реальной суммой и сторнируем её в регистре "Остатки планируемых покупок"
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ОстаткиПланируемыхПокупокОбороты.СуммаРасход,
		|	ОстаткиПланируемыхПокупокОбороты.СуммаПриход
		|ИЗ
		|	РегистрНакопления.ОстаткиПланируемыхПокупок.Обороты(, &ДатаДокумента, , ПланируемаяПокупка = &ПланируемаяПокупка) КАК ОстаткиПланируемыхПокупокОбороты";
		Запрос.УстановитьПараметр("ДатаДокумента", Дата);
		Запрос.УстановитьПараметр("ПланируемаяПокупка", ПланируемаяПокупка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			СторноПриход = Движения.ОстаткиПланируемыхПокупок.ДобавитьПриход();
			СторноПриход.ПланируемаяПокупка = ПланируемаяПокупка;
			СторноПриход.Период = Дата;
			СторноПриход.Сумма = Выборка.СуммаРасход - Выборка.СуммаПриход;
			
		КонецЕсли;
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(Основание)
	
	Валюта = Константы.ОсновнаяВалютаУчёта.Получить();
	
	Если ТипЗнч(Основание) = Тип("ДанныеФормыСтруктура") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Основание.Основание);
		ЭтотОбъект.Сумма = Основание.СуммаПлатежа;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Дата = НачалоДня(Дата);
КонецПроцедуры
